Revit 2027 API
BuiltInFailures.PerformanceFailures.DuplicateInstances Property
 There are duplicate instances of the same family in the same place. Delete duplicate instances to improve performance.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId DuplicateInstances { get; }
Public Shared ReadOnly Property DuplicateInstances As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ DuplicateInstances {
	FailureDefinitionId^ get ();
}
static member DuplicateInstances : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.PerformanceFailures Class
Autodesk.Revit.DB Namespace